Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If the C</r> (non-destructive) option is present, a new copy of the string is made and its characters transliterated, and this copy is returned no matter whether it was modified or not: the original string is always left unchanged.
es_es: Si la opción C</r> (no-destructiva) está presente, se crea una nueva copia de la cadena y sus caracteres transliterados, y esta copia es devuelta sin importar si fue modificada o no: la cadena original siempre permanece sin cambios.

source: (?<= \S ) # that ends in non-whitespace
es_es: (?<= \S ) # que termina en un no-blanco

source: This is usually something to be avoided when writing clear code.
es_es: Esto es algo usualmente a ser evitado cuando se está escribiendo código claro.

source: This is slower than unprototyped subroutines, where the elements to be compared are passed into the subroutine as the package global variables $a and $b (see example below).
es_es: Esto es más lento que las subrutinas no prototipadas, donde los elementos a comparar son pasados a la subrutina en las variables globales del paquete actual $a y $b (ver ejemplo más abajo).

source: =item splice ARRAY or EXPR
es_es: =item splice ARRAY o EXPR

source: C<CGI::Carp> works better in certain mod_perl configurations
es_es: C<CGI::Carp> funciona mejor en ciertas configuraciones de mod_perl

source: Because the result of C<"\Q STRING \E"> has all metacharacters quoted, there is no way to insert a literal C<$> or C<@> inside a C<\Q\E> pair.
es_es: Debido a que el resultado de C<"\Q STRING \E"> tiene todos los metacaracteres entrecomillados, no hay forma de insertar un literal C<$> o C<@> dentro de una pareja C<\Q\E>.

source: Binary "**" is the exponentiation operator.
es_es: Binario "**" es el operador de exponenciación.

source: Returns the value of EXPR with the first character lowercased.
es_es: Devuelve el valor de EXPR con el primer carácter en minúsculas.

source: $year += 1900;
es_es: $anno += 1900;

source: The status is returned in C<$?> and C<${^CHILD_ERROR_NATIVE}>.
es_es: El estado se devuelve en C<$?> y C<${^CHILD_ERROR_NATIVE}>.

source: January 12, 2006
es_es: 12 de enero 2006

source: In addition, note that Perl's pipes use IO buffering, so you may need to set C<$|> to flush your WRITEHANDLE after each command, depending on the application.
es_es: Además, tenga en cuenta que las tuberías de Perl utilizan el búfer de E/S, así que puede que necesite establecer C<$|> para limpiar su CONTROLADOR_ESCRITURA después de cada comando, dependiendo de la aplicación.

source: If no string is specified via the C<=~> or C<!~> operator, the $_ string is transliterated.
es_es: Si no se especifica una cadena a través de los operadores C<=~> o C<!~>, la cadena $_ es transliterada.

source: perl5100delta Perl changes in version 5.10.0
es_es: perl5100delta Cambios en la versión 5.10.0

source: The sendmsg(2) syscall is currently unimplemented.
es_es: La llamada del sistema sendmsg(2) no está, actualmente, implementada.

source: You can effect a sleep of 250 milliseconds this way:
es_es: Puede efectuar una espera de 250 milisegundos de esta manera:

source: Starting with Perl 5.14, C<push> can take a scalar EXPR, which must hold a reference to an unblessed array.
es_es: A partir de Perl 5.14, C<push> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: We'll say that the first part in $1 must be followed both by a digit and by something that's not "123".
es_es: Vamos a decir que la primera parte en $1 debe ser seguida tanto por un dígito como por algo que no es "123".

source: \D a non-digit
es_es: \D un carácter que no sea un dígito

source: perl581delta Perl changes in version 5.8.1
es_es: perl581delta Cambios en la versión 5.8.1

source: Extend your pattern's legibility by permitting whitespace and comments.
es_es: Amplía la legibilidad del patrón, al permitir espacios en blanco y comentarios.

source: That'll be $10 please, ma'am.
es_es: Van a ser $10, por favor, señora.

source: open(FOO, "-|") || exec "cat", "-n", $file;
es_es: open(FOO, "-|") || exec "cat", "-n", $archivo;

source: Given an expression that specifies the name of a subroutine, returns true if the specified subroutine has ever been declared, even if it is undefined.
es_es: Dada una expresión que especifica el nombre de una subrutina, devuelve verdadero si la subrutina especificada ha sido declarada, incluso si esta está indefinida.

source: This file everyone who's contributed to Perl.
es_es: En este archivo figuran todas las personas que han contribuido a Perl.

source: The content of the here doc is treated just as it would be if the string were embedded in backticks.
es_es: El contenido del documento indicado es tratado como si la cadena estuviera incrustada entre comillas invertidas.

source: perl590delta Perl changes in version 5.9.0
es_es: perl590delta Cambios en la versión 5.9.0

source: It is an error to refer to a name that is not declared somewhere in the pattern.
es_es: Es un error referirse a un nombre que no se haya declarado en alguna parte del patrón.

source: The constant folding routine is now wrapped in an exception handler, and if folding throws an exception (such as attempting to evaluate 0/0), perl now retains the current optree, rather than aborting the whole program.
es_es: La rutina de plegado de constantes está ahora envuelta por un manejador de excepciones, y si el plegado produce una excepción (por ejemplo, al intentar evaluar 0/0), perl ahora conserva el árbol de operaciones actual, en lugar de abortar todo el programa.

source: Uncuddled elses.
es_es: else en nueva línea. No en la misma línea que la llave de cierre del if.

source: For compatibility with older scripts written before __DATA__ was introduced, __END__ behaves like __DATA__ in the top level script (but not in files loaded with C<require> or C<do>) and leaves the remaining contents of the file accessible via C<main::DATA>.
es_es: Por compatibilidad con I<scripts> viejos escritos antes de la introducción de __DATA__, __END__ se comporta como __DATA__ en el script de nivel superior (pero no en los archivos cargados con C<require> o C<do>) y deja el resto del contenido del archivo accesible a través de C<main::DATA>.

source: =item Operators which expect an integer
es_es: =item Operadores que consumen un entero

source: Here's a descending numeric sort of a hash by its values:
es_es: Esto es una ordenación numérica descendente de un hash por sus valores:

source: A sound principle is to use only ranges that begin from and end at either alphabetics of equal case ([a-e], [A-E]), or digits ([0-9]).
es_es: Un buen principio es el de usar rangos que sólo comiencen y terminen, de forma alfabética, con un mismo tamaño de caja ([a-e], [A-E]), o dígitos ([0-9]).

source: The functionality has been supplanted by the C</s> and C</m> modifiers on pattern matching.
es_es: La funcionalidad ha sido reemplazada por los modificadores C</s> y C</m> en la coincidencia de patrones.

source: \o{23072} [6,8] octal char (example: SMILEY)
es_es: \o{23072} [6,8] car. octal (ejemplo: SMILEY)

source: say '$foo is numerically less than 100';
es_es: say '$foo es numéricamente menor que 100';

source: my $lrr = shift; # ref to array of array refs!
es_es: my $lrr = shift; # ¡ref. a un array de array de ref.!

source: Return an undefined value.
es_es: Devolver un valor indefinido.

source: In particular, you cannot expect it to be a "creation time"; see L<perlport/"Files and Filesystems"> for details.
es_es: En particular, no puede esperar que sea el "tiempo de creación"; vea L<perlport/"Archivos y sistemas de archivos"> para más detalles.

source: Arranges for FILEHANDLE to be read or written in "binary" or "text" mode on systems where the run-time libraries distinguish between binary and text files.
es_es: Ordena que el modo de lectura o escritura para el IDENTIFICADOR_ARCHIVO sea en "binario" o "texto" en sistemas donde las bibliotecas en tiempo de ejecución distingan entre archivos binarios y de texto.

source: # a compile-time error
es_es: # un error en tiempo de compilación

source: Usually this name is a single I<identifier>, that is, a string beginning with a letter or underscore, and containing letters, underscores, and digits.
es_es: Normalmente, este nombre es un I<identificador>, es decir, una palabra que comienza por una letra o carácter de subrayado y que contiene letras, caracteres de subrayado o dígitos.

source: If there is a filehandle, then the subroutine will be called to act as a simple source filter, with the line as read in C<$_>.
es_es: Si hay un identificador de archivo, a continuación, la subrutina será llamada a actuar como un simple filtro de código fuente, con la línea leída en C<$_>.

source: # assign to our array, an array of array references
es_es: # asignar a nuestro array, un array de referencias a array

source: If EXPR starts off with C<0b>, it is interpreted as a binary string.
es_es: Si EXPR empieza con C<0b>, se interpreta como una cadena binaria.

source: As a side effect, calling keys() resets the internal interator of the HASH or ARRAY (see L</each>).
es_es: Como efecto colateral, llamando a keys() reinicia el iterador interno del HASH o del ARRAY (vea L</each>).

source: There are quite a few systems out there that do worse!
es_es: En muchos sistemas los resultados obtenidos son peores...

source: $a = '(.)\1'; # Creates problems when concatenated.
es_es: $a = '(.)\1'; # Crea problemas cuando es concatenado.

source: The C</> template character allows packing and unpacking of a sequence of items where the packed structure contains a packed item count followed by the packed items themselves.
es_es: La plantilla C</> permite empaquetar y desempaquetar una secuencia de elementos en donde la estructura empaquetada contiene un contador de elementos empaquetados seguido por los propios elementos empaquetados.

source: That means that case-mapping a single character can sometimes produce several characters.
es_es: Esto significa que el mapeo de un único carácter a veces puede producir varios caracteres.

source: =item use Module VERSION LIST X<use> X<module> X<import>
es_es: =item use Módulo VERSIÓN LISTA X<use> X<module> X<import> X<módulo> X<importar>

source: Deletes the directory specified by FILENAME if that directory is empty.
es_es: Elimina el directorio especificado por NOMBRE_DIRECTORIO si ese directorio está vacío.

source: Note also that smart match's matching rules take precedence over overloading, so if C<$obj> has smart match overloading, then
es_es: Note también que las reglas de coincidencias de la coincidencia inteligente toman precedencia sobre la sobrecarga, así que si C<$obj> tiene sobrecargado la coincidencia inteligente, entonces

source: X Back up a byte.
es_es: X Retrocede un byte.

source: C<ExtUtils::MakeMaker> upgraded to version 6.30 (was 6.17)
es_es: C<ExtUtils::MakeMaker> actualizado a la versión 6.30 (era 6.17)

source: However, this also bars you from opening pipes to commands that intentionally contain shell metacharacters, such as:
es_es: Sin embargo, esto también le impedirá la apertura de tuberías a comandos que, intencionalmente, contenga metacaracteres shell, tales como:

source: Although quicksort's run time is O(NlogN) when averaged over all arrays of length N, the time can be O(N**2), I<quadratic> behavior, for some inputs.) In 5.7, the quicksort implementation was replaced with a stable mergesort algorithm whose worst-case behavior is O(NlogN).
es_es: Aunque el tiempo de ejecución de quicksort es O(NlogN) de promedio de todos los arrays de longitud N, el tiempo puede ser O(N**2), comportamiento I<cuadrático>, para algunas entradas). En v5.7 la implementación de quicksort fue reemplazada con un algoritmo estable mergesort cuyo peor comportamiento es O(NlogN).

source: All values must be read before it will start over.
es_es: Todos los valores deben ser leídos antes de empezar de nuevo.

source: FILEHANDLE may be an expression whose value gives the name of the filehandle.
es_es: IDENTIFICADOR_ARCHIVO puede ser una expresión cuyo valor da el nombre del identificador de archivo.

source: See L<perllocale>.
es_es: Vea L<perllocale>.

source: You must put the list in parentheses to avoid ambiguity.
es_es: Debe poner la lista entre paréntesis para evitar ambigüedades.

source: The integer types C<s>, C<S>, C<l>, and C<L> may be followed by a C<!> modifier to specify native shorts or longs.
es_es: Los tipos enteros C<s>, C<S>, C<l>, y C<L> pueden ser seguidos por un modificar C<!> para especificar un corto (short) o largo (long) nativos.

source: For systems from the Microsoft family this means that, if your binary data contain C<\cZ>, the I/O subsystem will regard it as the end of the file, unless you use binmode().
es_es: Para los sistemas de la familia Microsoft esto significa que si sus datos binarios contienen C<\cZ>, el subsistema de E/S lo considerará como el fin del archivo, a menos que use binmode().

source: B<NOTE>: Unlike C and other languages, Perl has no C<\v> escape sequence for the vertical tab (VT - ASCII 11), but you may use C<\ck> or C<\x0b>.
es_es: B<NOTA>: A diferencia de C y otros lenguajes, Perl no tiene una secuencia de escape C<\v> para el tabulado vertical (VT - ASCII 11), pero puede usar C<\ck> o C<\x0b>.

source: One or more embedded pattern-match modifiers, to be turned on (or turned off, if preceded by C<->) for the remainder of the pattern or the remainder of the enclosing pattern group (if any).
es_es: Uno o más modificadores de coincidencia de patrón incrustados, que han de ser activados (o desactivados, si son precedidos por C<->) para el resto del patrón o el resto del grupo de patrón más interior (si existe).

source: Whitespace between the function and left parenthesis doesn't count, so sometimes you need to be careful:
es_es: El espacio en blanco entre la función y el paréntesis izquierdo no cuenta, por lo que deberá tener cuidado en algunas ocasiones:

source: DESTROY this
es_es: DESTROY este

source: CLEAR this
es_es: CLEAR este

source: Without a BLOCK it's just a forward declaration.
es_es: Sin un BLOQUE es sólo una declaración previa.

source: If you are not under C<use threads::shared> this does nothing.
es_es: Si no está bajo C<use threads::shared>, no hará nada.

source: See L<perlopentut> and L<perlfunc/open> for details on this.
es_es: Vea L<perlopentut> y L<perlfunc/open> para más detalles sobre esto.

source: If the substring is not found, C<index> returns one less than the base, ordinarily C<-1>.
es_es: Si el substring no se encuentra, C<index> devuelve uno menos que la base, normalmente C<-1>.

source: In particular Steve Hay has worked to side step many warnings emitted by their compilers and at least one C compiler internal error.
es_es: En particular, Hay Steve trabajó para quitar muchas advertencias emitidas por estos compiladores y al menos un error interno del compilador de C.

source: It is possible to inspect both the string given to RE engine and the resulting finite automaton.
es_es: Es posible inspeccionar tanto la cadena dada al motor RE y el autómata finito que resulta.

source: Used with a C<foreach> loop or the experimental C<given> block, C<when> can be used in Perl to implement C<switch>/C<case> like statements.
es_es: Usando con un bucle C<foreach> o el experimental bloque C<given>, C<when> puede ser usado en Perl para implementar instrucciones parecidas a C<switch>/C<case>.

source: If you want to use mod_perl 2.x with Perl 5.8.1, you will need mod_perl-1.99_10 or higher.
es_es: Si desea utilizar mod_perl 2.x. con Perl 5.8.1, necesitará mod_perl-1.99_10 o superior.

source: Iain 'Spoon' Truskett, Perl hacker, author of L<perlreref> and contributor to CPAN, died suddenly on 29th December 2003, aged 24.
es_es: Iain 'Spoon' Truskett, Perl hacker, autor de L<perlreref> y contribuidor a CPAN, murió repentinamente el 29 de diciembre de 2003, a la edad de 24 años.

source: now gives a C<"our" variable %s redeclared> warning.
es_es: ahora da una advertencia C<"our" variable %s redeclared>.

source: If there is no corresponding capture group defined, then it is a fatal error.
es_es: Si no se define un correspondiente grupo de captura, entonces es un error fatal.

source: while (($key,$value) = each %ENV) {
es_es: while (($clave,$valor) = each %ENV) {

source: =item open FILEHANDLE,MODE,EXPR,LIST
es_es: =item open IDENTIFICADOR_ARCHIVO,MODO,EXPR,LISTA

source: NAME should be a packed address of the appropriate type for the socket.
es_es: NOMBRE debe ser una dirección empaquetada del tipo apropiado para el socket.

source: On systems that support fchdir(2), you may pass a filehandle or directory handle as the argument.
es_es: En sistemas que soportan fchdir(2), puede pasarle un identificador de archivo o un identificador de directorio como argumento.

source: =item scalar EXPR X<scalar> X<context>
es_es: =item scalar EXPR X<scalar> X<context> X<escalar> X<contexto>

source: In non-Unix environments, the functionality of some Unix system calls may not be available or details of the available functionality may differ slightly.
es_es: En entornos no Unix, la funcionalidad de algunas llamadas del sistema Unix pueden no estar disponibles, o los detalles de la funcionalidad disponible pueden diferir ligeramente.

source: You can also find out from within Perl what your $quota and $comment fields mean and whether you have the $expire field by using the C<Config> module and the values C<d_pwquota>, C<d_pwage>, C<d_pwchange>, C<d_pwcomment>, and C<d_pwexpire>.
es_es: Puede también encontrar dentro de Perl que es lo que significan sus campos $cuota, $comentario y $expira usando el módulo C<Config> y los valores C<d_pwquota>, C<d_pwage>, C<d_pwchange>, C<d_pwcomment> y C<d_pwexpire>.

source: Tests for the core support of Unicode.
es_es: Pruebas de compatibilidad básica con Unicode.

source: See also L<perlipc/"SysV IPC"> and the documentation for C<IPC::SysV> and C<IPC::Semaphore>.
es_es: Vea también la documentación de L<perlipc/"SysV IPC"> y C<IPC::SysV> y C<IPC::Semaphore>.

source: If LENGTH is omitted, returns everything through the end of the string.
es_es: Si se omite LONGITUD, devuelve todo hasta el final de la cadena.

source: =head2 What's the difference between "perl" and "Perl"?
es_es: =head2 ¿Cuál es la diferencia entre "perl" y "Perl"?

source: See L</"Regexp Quote-Like Operators"> for details and L<perlretut> for examples using these operators.
es_es: Ver L</"Operadores Regexp entrecomillados"> para más detalles y L<perlretut> para ejemplos usando estos operadores.

source: Sets FILEHANDLE's position, just like the C<fseek> call of C<stdio>.
es_es: Establece la posición de IDENTIFICADOR_ARCHIVO, igual que la llamada C<fseek> de C<stdio>.

source: # using an in-line function
es_es: # usando una función incluida

source: Note that a subroutine that does not exist may still be callable: its package may have an C<AUTOLOAD> method that makes it spring into existence the first time that it is called; see L<perlsub>.
es_es: Note que una subrutina que no existe puede ser llamada: su paquete puede tener un método C<AUTOLOAD> que la hace aparecer la primera vez que es llamada; ver L<perlsub>.

source: It should be noted that C<~~> will refuse to work on objects that don't overload it (in order to avoid relying on the object's underlying structure).
es_es: Se debe hacer notar que C<~~> rechazará funcionar en objetos que no lo sobrecargan (para no depender de la estructura subyacente del objeto)

source: If you or your team can be faster, better, and stronger through Perl, you'll deliver more value.
es_es: Si con Perl usted y su equipo pueden desarrollar de manera más rápida y mejor, su productividad aumentará.

source: It doesn't matter whether those elements are already there or not: it'll gladly create them for you, setting intervening elements to C<undef> as need be.
es_es: No importa qué elementos estén allí o no: serán, con mucho gusto, creados para usted, estableciendo elementos intermedios a C<undef> cuando sea necesario.

source: perl573delta - what's new for perl v5.7.3
es_es: perl573delta - qué hay de nuevo para perl v5.7.3

source: In these cases, whitespace and comments are allowed between both parts, though the comment must follow at least one whitespace character; otherwise a character expected as the start of the comment may be regarded as the starting delimiter of the right part.
es_es: En estos casos, los espacios en blanco y los comentarios están permitidos entre ambas partes, aunque el comentario debe estar precedido, por lo menos, de un espacio en blanco; de lo contrario, un carácter esperado como inicio del comentario puede ser considerado como el delimitador de inicio de la parte derecha.

source: If you say
es_es: Si usted dice

source: open my $logfile, ">>", "my.log" or die "Could not open my.log: $!";
es_es: open my $registro, ">>", "mi.registro" or die "No se pudo abrir mi.registro: $!";

source: To transform a bit vector into a string or list of 0's and 1's, use these:
es_es: Para transformar un vector de bits en una cadena o una lista de 0 y 1, utilice los siguientes:

source: force the argument into the integer format.
es_es: Fuerzan la conversión del argumento al formato de entero.

source: print +(1+2)+4; # Prints 7.
es_es: print +(1+2)+4; # Imprime 7.

source: h interpret integer as C type "short" or "unsigned short"
es_es: h interpreta un entero como un "short" o "unsigned short" del C

source: If BITS is 8, "elements" coincide with bytes of the input string.
es_es: Si BITS es 8, los "elementos" coinciden con bytes de la cadena de entrada.

source: =item ref EXPR X<ref> X<reference>
es_es: =item ref EXPR X<ref> X<reference> X<referencia>

source: =item sin EXPR X<sin> X<sine> X<asin> X<arcsine>
es_es: =item sin EXPR X<sin> X<sine> X<asin> X<arcsine> X<arco seno> X<seno>

source: As with filehandles and labels, a bareword that consists entirely of lowercase letters risks conflict with future reserved words, and if you use the C<use warnings> pragma or the B<-w> switch, Perl will warn you about any such words.
es_es: Al igual que con identificadores de archivo y las etiquetas, una palabra suelta que consiste enteramente en minúsculas tiene el riesgo de llegar a un conflicto con los futuras palabras reservadas, y si utiliza el pragma C<use warnings> o la opción B<-w>, Perl le advertirá sobre cualquiera de estas palabras.

source: Stable modules should maintain backwards compatibility
es_es: Módulos estables deben mantener la compatibilidad hacia atrás

# print "Beginning is <$1>, number is <$2>. ";
source: print "Beginning is <$1>, number is <$2>.\n";
es_es: print "El comienzo es <$1>, número es <$2>.\n";

source: The C<x> repetition operator is now able to operate on C<qw//> lists.
es_es: El operador de repetición C<x> es ahora capaz de operar en listas C<qw//>.

source: Here's an example that looks up nonnumeric uids in the passwd file:
es_es: Aquí hay un ejemplo que obtiene el uid numérico a partir del archivo de contraseñas:

source: Attempts to receive LENGTH characters of data into variable SCALAR from the specified SOCKET filehandle.
es_es: Intenta leer LONGITUD I<caracteres> de datos en la variable ESCALAR del identificador de archivo SOCKET especificado.

source: The Perl debugger (F<lib/perl5db.pl>) can now save all debugger commands for sourcing later, and can display the parent inheritance tree of a given class.
es_es: El depurador de Perl (F<lib/perl5db.pl>) ahora puede guardar todos los comandos del depurador para ser analizados más tarde, y puede mostrar el árbol de herencia de una clase padre dada.
